::µ{¦¡¤¶­±³]©w
@echo off
@SETLOCAL ENABLEEXTENSIONS
@COLOR 17
TITLE Reset Minecraft Server World: Original Edition
cls


:Start
::±Ò°Êµ{¦¡©ÒÅã¥Üªºµe­±
echo If you still can see this file after the program closed, the reason is the program wrongly shut down. > ProgramRunning.txt
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo   Copyright (c) Dawn Studio 2015
Echo.
Echo ------------------------------------------------------------------------------
@ping 127.0.0.1 -n 5 -w 1000 > nul
for /f "tokens=1 delims=" %%x in (.Reset.txt) do set Reset=%%~x
if [%Reset%] == [] goto Exit
cls
Goto Menu


:Menu
::¸ß°Ý¥Î®a¬O§_­n­«³]¥@¬É
set Confirmation=
Echo ------------------------------------------------------------------------------
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo   The program will be reset the original world to "%Reset%".
Echo   If you determine please enter "Y", to cancel please enter "N".
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo   Reset Confirmation:
Echo     [Y]es
Echo     [N]o
Echo   *Please enter the first letter of the item you want to select.
Echo.
Echo ------------------------------------------------------------------------------
Echo.
set /P Confirmation=  Please select an item: %=%
Echo.
Echo ------------------------------------------------------------------------------
cls
If %Confirmation% == Y goto Reset
If %Confirmation% == N goto Exit
If %Confirmation% == y goto Reset
If %Confirmation% == n goto Exit
goto Menu


:Reset
:Reset_Remove
::²¾°£ÂÂÀÉ®×
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo        ¢z¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w  0%%¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢{
Echo        ¢|¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¢}
Echo          Status: Remove old files
Echo.
Echo ------------------------------------------------------------------------------
@rmdir /s /q Game
@ping 127.0.0.1 -n 2 -w 1000 > nul
cls
goto Reset_Creat
:Reset_Creat
::³Ð«Ø¸ê®Æ§¨
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo        ¢z¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w 33%%¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢{
Echo        ¢|ùþùþùþùþùþùþùþùþùþùþ¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¢}
Echo          Status: Create folder
Echo.
Echo ------------------------------------------------------------------------------
@mkdir Game
@ping 127.0.0.1 -n 2 -w 1000 > nul
cls
goto Reset_Copy
:Reset_Copy
::½Æ»sÀÉ®×
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo        ¢z¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w 67%%¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢{
Echo        ¢|ùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþ¡@¡@¡@¡@¡@¡@¡@¡@¡@¡@¢}
Echo          Status: Copying file
Echo.
Echo ------------------------------------------------------------------------------
@xcopy ".World\%Reset%" Game /S /Q > nul
@ping 127.0.0.1 -n 2 -w 1000 > nul
cls
goto Reset_Finished
:Reset_Finished
::§¹¦¨­«³]¥@¬É
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo        ¢z¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w100%%¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢w¢{
Echo        ¢|ùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþùþ¢}
Echo          Status: Finished
Echo.
Echo ------------------------------------------------------------------------------
@ping 127.0.0.1 -n 2 -w 1000 > nul
cls
goto Reset_Exit
:Reset_Exit
::°h¥X­«³]¥@¬É
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo   Finished reset the world, About to exit the program.
Echo.
Echo ------------------------------------------------------------------------------
Echo.
PAUSE
Echo.
Echo ------------------------------------------------------------------------------
cls
goto Exit


:Exit
::Ãö³¬µ{¦¡
Echo ==============================================================================
Echo.
Echo          ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@¡@¡@ùþ
Echo          ùþ¡@¡@ùþ¡@ùþùþ¡@ùþùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ
Echo          ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ¡@ùþùþùþùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþ¡@¡@ùþ¡@ùþ¡@ùþ¡@¡@¡@¡@ùþ¡@ùþ¡@ùþ¡@ùþ
Echo          ùþ¡@ùþùþ¡@ùþ¡@¡@¡@ùþ¡@ùþùþùþùþ¡@¡@ùþ¡@ùþ¡@¡@Original Edition
Echo.
Echo ==============================================================================
Echo.
Echo   Reset Minecraft Server World
Echo.
Echo ------------------------------------------------------------------------------
Echo.
Echo   Thank you for using our application, goodbye!
Echo   The program has been closed.
Echo.
Echo ------------------------------------------------------------------------------
@ping 127.0.0.1 -n 5 -w 1000 > nul
cls
del ProgramRunning.txt
Exit /B